Revit 2027 API
ColorFillLegend.SetColumnWidths Method
 Sets array of column widths.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetColumnWidths(
	IList<double> widths
)
Public Sub SetColumnWidths (
	widths As IList(Of Double)
)
public:
void SetColumnWidths(
	IList<double>^ widths
)
member SetColumnWidths :
        widths : IList<float> -> unit
Parameters
widths IList<Double>
Exceptions
Exception | Condition
ArgumentException |  Array is not valid.
ArgumentNullException |  A non-optional argument was null
Remarks
 Input array length must be the same as what GetColumnWidths() returns. It can only contain positive values.
See Also
Reference
ColorFillLegend Class
Autodesk.Revit.DB Namespace